"""
เครื่องคำนวรค่าไฟฟ้าแบบขั้นบันได
เขียนดปรแกรมคำนซรค่าไฟฟ้าจากจำนวณหน่อยไฟฟ้าที่ใช้ในเดือนนั้น โดยใช้ฟังก์ชัน
calculate_electricity_cost(units)

ค่าไฟฟ้าขึ้นกับปรมาณการใช้ไฟฟ้า
จำนวนหน่วยที่ใช้       อัตราต่อหน่วย
1-50 หน่วย                2.50 บาท
51-100 หน่วย              3.00 บาท
101-200 หน่วย             3.50 บาท
มากกว่า 200 หน่วย          4.00 บาท    

ให้คิดค่าบริการคงที่เพิ่มอีก 25 บาทต่อหน่วย
    - โปรแกรมแสดงคาเมนูวนซ้ำ
    - ผู้ใช้เลือก 1 เพื่อคำนวณค่าไฟ
    - ผู้ใช้เลือก 2 เพื่อคำนวณค่าไฟ
    - หาเลือกเมนูอื่นให้แจ้งว่าเลือกเมนุไม่ถูกต้อง
    - จำนวนไฟฟ้าต้องไม่ติดลบ
    - ให้แสดงละเอียดค่าไฟในแต่ละช่วงและยอกรวมสุทธิ

ตัวอย่างหน้าจอ
 ===========โปรแกรมคำนวณไฟฟ้า=============
    1.คำนวณไฟฟ้า
    2.ออกจากโปรแกรม
    เลือกเมนู: 1

    กรอกจำนวนหน่วยไฟฟ้า:

    รายละเอียดค่าไฟ 
    1-50 หน่วย: 125.00 บาท
    51-100 หน่วย: 150.00 บาท
    101-120 หน่วย: 70.00 บาท
    ค่าบริการ: 25.00 บาท
    รวมค่าไฟฟ้าทั้งสิ้น 370.00 บาท
"""
units = 250
def  calculate_electricity_cost(units) :
    if units > 200 :
        cost = (2.50 * 50) + (3.00 * 50) + (3.50 * 50) + ((units - 200 ) * 4.00) + 25
        print("1-50 หน่วย: 125.00 บาท")
        print("51-100 หน่วย: 150.00 บาท")
        print("101-200 หน่วย: 350.00 บาท")
        print(f"201-{units} หน่วย: {(units - 200) * 3.50}บาท")
        print("ค่าบริการ: 25.00 บาท")
        print("รวมค่าไฟฟ้าทั้งสิ้น", cost)
        
    elif units > 100 :
        cost = (2.50 * 50) + (3.00 * 50) + ((units - 100 ) * 3.50)  + 25
        print("1-50 หน่วย: 125.00 บาท")
        print("51-100 หน่วย: 150.00 บาท")
        print(f"101-{units} หน่วย: {(units - 100) * 3.50}บาท")
        print("ค่าบริการ: 25.00 บาท")
        print("รวมค่าไฟฟ้าทั้งสิ้น", cost)

    elif units > 50 :
        cost = (2.50 * 50) + ((units - 50 ) * 3.00) + 25
        print("1-50 หน่วย: 125.00 บาท")
        print(f"51-{units} หน่วย: {(units - 50) * 3.00}บาท")
        print("ค่าบริการ: 25.00 บาท")
        print("รวมค่าไฟฟ้าทั้งสิ้น", cost)

    elif units > 0 :
        cost = (2.50 * units) + 25
        print(f"1-{units} หน่วย: {2.50 * units}บาท")
        print("ค่าบริการ: 25.00 บาท")
        print("รวมค่าไฟฟ้าทั้งสิ้น", cost)
    else :
        print("จำนวนไฟฟ้าต้องไม่ติดลบ")

units = int(input("กรอกจำนวนไฟฟ้า :"))
calculate_electricity_cost(units)

print("==========โปรแกรมคำนวณไฟฟ้า==========")
while(True):
    print("1.คำนวณไฟฟ้า")
    print("2.ออกจากโปรแกรม")
    choice = input(" เลือกเมนู")

    if choice == "1":
        units = int(input("กรอกจำนวนหน่วยไฟฟ้า"))
        calculate_electricity_cost(units)
    elif choice == "2":
            break
    else:
        print("ให้แจ้งว่าเลือกเมนูไม่ถูกต้อง")